package Login;

import javax.swing.*;

public class LibTable {

    public void info(){
        JFrame jf = new JFrame("图书管理界面");
        String[] titles ={"id","书籍分类","书名","作者","出版时间","剩余数量","被借数量","可否借阅"};
        String table[][] ={
                {"1001","文学类","《钢铁是怎么练成的》","尼古拉奥斯特洛夫斯基","1933年","2","4","1"},
                {"1002","文学类","《简爱》","夏洛蒂勃朗特","1874年","4","8","1"},
                {"1004","文学类","《四世同堂》","老舍","1933年","1","5","1"},
                {"1005","文学类","《冰心散文集》","冰心","2002年","0","4","1"},
                {"1006","文学类","《活着》","余华","1992年","6","0","0"},
                {"1008","文学类","《思考快与慢》","丹尼尔卡尼曼","2012年","1","4","1"},
                {"1040","文学类","《野草》","鲁迅","1927年","2","10","1"},
                {"1043","理科类","《计算机操作系统》","汤小丹","2017年","2","4","1"},
                {"1089","理科类","《计算机网络》","谢希仁","1999年","12","4","1"},
                {"1090","趣味类","《十万个为什么》","米·伊林","1896年","6","4","1"},
                {"2001","理科类","《信息安全原理与应用技术》","张建","2020年","7","0","0"},
        };

        JTable jt =new JTable(table,titles);
        jf.add(new JScrollPane(jt));
        jf.pack();
        jf.setVisible(true);
    }


}
